#include "conv.hpp"
#include <string>

int find_index(std::string array[], std::string letter) {
    for (int i = 0; i < 66; ++i) {
        if (array[i] == letter) {
            return i;
        }
    }
    return -1;
}

std::string alpha[] = {
    "à", "á", "â", "ã", "ä", "å", "¸", "æ", "ç", "è",
    "é", "ê", "ë", "ì", "í", "î", "ï", "ð", "ñ", "ò", 
    "ó", "ô", "õ", "ö", "÷", "ø", "ù", "ú", "û", "ü",
    "ý", "þ", "ÿ", 

    "À", "Á", "Â", "Ã", "Ä", "Å", "¨", "Æ", "Ç", "È",
    "É", "Ê", "Ë", "Ì", "Í", "Î", "Ï", "Ð", "Ñ", "Ò",
    "Ó", "Ô", "Õ", "Ö", "×", "Ø", "Ù", "Ú", "Û", "Ü",
    "Ý", "Þ", "ß",
};


std::string translit[] = {
    "a", "b", "v", "g", "d", "e", "yo", "zh", "z", "i",
    "y", "k", "l", "m", "n", "o", "p", "r", "s", "t",
    "u", "f", "kh", "ts", "ch", "sh", "shch", "", "y", "'",
    "e", "yu", "ya",

    "A", "B", "V", "G", "D", "E", "Yo", "Zh", "Z", "I",
    "Y", "K", "L", "M", "N", "O", "P", "R", "S", "T",
    "U", "F", "Kh", "Ts", "Ch", "Sh", "Shch", "", "Y", "'",
    "E", "Yu", "Ya",
};

